11/data/attachments/a0fdd76afe31e955.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:updateUserRequest>
            <nif:user>
                <nif:id>f24b214a-5aa2-4f34-bbba-c749ababa250</nif:id>
                <nif:username>soap_user_c43ebb3d-a783-4693-9a39-79c8ccd4d5a5</nif:username>
                <nif:currency>USD</nif:currency>
                
                
                
                
                &lt;nif:fullName&gt;{ Martha Shields }&lt;/nif:fullName&gt;
                
            </nif:user>
        </nif:updateUserRequest>
    </soapenv:Body>
</soapenv:Envelope>